## Bentoci Plan Summary

| Workspace | Project | Environment | Status | Changes |
|-----------|---------|-------------|--------|---------|
| [`sandbox-test-1`](https://nonanarchical-squeakingly-anastasia.ngrok-free.dev/app/workspaces/08c64d6e-c4ec-4cae-9991-39195d507422) | Sandbox | -- | ✅ Plan complete | Plan: 9 to add, 0 to change, 0 to destroy. |

<details>
<summary>✅ Plan complete — `sandbox-test-1`</summary>

```
... (98 lines truncated) ...
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-integration-dev-ecr-writer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "app-integration"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.ecr_read_only will be created
  + resource "aws_iam_role_policy" "ecr_read_only" {
      + id          = (known after apply)
      + name        = "ecr-read-only-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetAuthToken"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:eu-west-1:*:repository/*"
                      + Sid      = "PullImages"
                    },
                  + {
                      + Action   = [
                          + "ecr:ListImages",
                          + "ecr:DescribeRepositories",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:eu-west-1:*:repository/*"
                      + Sid      = "DescribeRepositories"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.ecr_writer will be created
  + resource "aws_iam_role_policy" "ecr_writer" {
      + id          = (known after apply)
      + name        = "ecr-writer-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetAuthToken"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:eu-west-1:*:repository/*"
                      + Sid      = "PushImages"
                    },
                  + {
                      + Action   = [
                          + "ecr:ListImages",
                          + "ecr:DescribeRepositories",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:eu-west-1:*:repository/*"
                      + Sid      = "DescribeRepositories"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "app-integration"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # random_pet.bucket_suffix will be created
  + resource "random_pet" "bucket_suffix" {
      + id        = (known after apply)
      + keepers   = {
          + "project" = "app-integration"
        }
      + length    = 2
      + separator = "-"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_read_only_role_arn  = (known after apply)
  + ecr_read_only_role_name = "app-integration-dev-ecr-read-only"
  + ecr_writer_role_arn     = (known after apply)
  + ecr_writer_role_name    = "app-integration-dev-ecr-writer"
  + s3_bucket_arn           = (known after apply)
  + s3_bucket_name          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

---
*Updated 2026-03-29 03:15 UTC* | [View in Bentoci](#)
